lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
#include <NimBLEDevice.h>
#include <NimBLEUtils.h>
#include <NimBLEServer.h>
#include "NimBLEHIDDevice.h"
#include "HIDTypes.h"
#include "HIDKeyboardTypes.h"
#include <driver/adc.h>
#include "sdkconfig.h"

#include "BleConnectionStatus.h"
#include "BleGamepad.h"
#include "BleGamepadConfiguration.h"

#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "BLEGamepad"
#else
#include "esp_log.h"
static const char *LOG_TAG = "BLEGamepad";
#endif

uint8_t tempHidReportDescriptor[150];
int hidReportDescriptorSize = 0;
uint8_t _hidReportId = 3;
uint8_t reportSize = 0;
uint8_t numOfButtonBytes = 0;

BleGamepad::BleGamepad(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel) : _controllerType(CONTROLLER_TYPE_GAMEPAD),
																									   _buttons(),
																									   _x(0),
																									   _y(0),
																									   _z(0),
																									   _rZ(0),
																									   _rX(0),
																									   _rY(0),
																									   _slider1(0),
																									   _slider2(0),
																									   _rudder(0),
																									   _throttle(0),
																									   _accelerator(0),
																									   _brake(0),
																									   _steering(0),
																									   _hat1(0),
																									   _hat2(0),
																									   _hat3(0),
																									   _hat4(0),
																									   hid(0)
{
	this->resetButtons();
	this->deviceName = deviceName;
	this->deviceManufacturer = deviceManufacturer;
	this->batteryLevel = batteryLevel;
	this->connectionStatus = new BleConnectionStatus();
}

void BleGamepad::resetButtons()
{
	memset(&_buttons, 0, sizeof(_buttons));
	memset(&_includeSpecialButton, 0, sizeof(_includeSpecialButton));
}

void BleGamepad::setControllerType(uint8_t controllerType)
{
	_controllerType = controllerType;
}

void BleGamepad::begin(BleGamepadConfig config)
{
	memcpy(configuration, &config, sizeof(config)); // so the user can't change actual values midway through operation

	uint8_t buttonPaddingBits = 8 - (_buttonCount % 8);
	if (buttonPaddingBits == 8)
	{
		buttonPaddingBits = 0;
	}
	uint8_t specialButtonPaddingBits = 8 - (_specialButtonCount % 8);
	if (specialButtonPaddingBits == 8)
	{
		specialButtonPaddingBits = 0;
	}
	uint8_t numOfAxisBytes = axisCount * 2;
	uint8_t numOfSimulationBytes = simulationCount * 2;

	numOfButtonBytes = _buttonCount / 8;
	if (buttonPaddingBits > 0)
	{
		numOfButtonBytes++;
	}

	uint8_t numOfSpecialButtonBytes = _specialButtonCount / 8;
	if (specialButtonPaddingBits > 0)
	{
		numOfSpecialButtonBytes++;
	}

	reportSize = numOfButtonBytes + numOfSpecialButtonBytes + numOfAxisBytes + numOfSimulationBytes + _hatSwitchCount;

	// USAGE_PAGE (Generic Desktop)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

	// USAGE (Joystick - 0x04; Gamepad - 0x05; Multi-axis Controller - 0x08)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
	tempHidReportDescriptor[hidReportDescriptorSize++] = _controllerType;

	// COLLECTION (Application)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

	// REPORT_ID (Default: 3)
	tempHidReportDescriptor[hidReportDescriptorSize++] = 0x85;
	tempHidReportDescriptor[hidReportDescriptorSize++] = _hidReportId;

	if (_buttonCount > 0)
	{

		// USAGE_PAGE (Button)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;

		// LOGICAL_MINIMUM (0)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

		// LOGICAL_MAXIMUM (1)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

		// REPORT_SIZE (1)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

		// USAGE_MINIMUM (Button 1)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x19;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

		// USAGE_MAXIMUM (Up to 128 buttons possible)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x29;
		tempHidReportDescriptor[hidReportDescriptorSize++] = _buttonCount;

		// REPORT_COUNT (# of buttons)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
		tempHidReportDescriptor[hidReportDescriptorSize++] = _buttonCount;

		// UNIT_EXPONENT (0)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x55;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

		// UNIT (None)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x65;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

		// INPUT (Data,Var,Abs)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

		if (buttonPaddingBits > 0)
		{

			// REPORT_SIZE (1)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

			// REPORT_COUNT (# of padding bits)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
			tempHidReportDescriptor[hidReportDescriptorSize++] = buttonPaddingBits;

			// INPUT (Const,Var,Abs)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;

		} // Padding Bits Needed

	} // Buttons

	if (_specialButtonCount > 0)
	{
		// LOGICAL_MINIMUM (0)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x15;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

		// LOGICAL_MAXIMUM (1)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x25;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

		// REPORT_SIZE (1)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

