lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
		if (_includeSpecialButton[0] || _includeSpecialButton[1] || _includeSpecialButton[2])
		{

			// USAGE_PAGE (Generic Desktop)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

			// REPORT_COUNT
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
			tempHidReportDescriptor[hidReportDescriptorSize++] = (int)_includeSpecialButton[0] + (int)_includeSpecialButton[1] + (int)_includeSpecialButton[2];

			if (_includeSpecialButton[0])
			{
				// USAGE (Start)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x3D;
			}

			if (_includeSpecialButton[1])
			{
				// USAGE (Select)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x3E;
			}

			if (_includeSpecialButton[2])
			{
				// USAGE (App Menu)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x86;
			}

			// INPUT (Data,Var,Abs)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;
		}

		if (_includeSpecialButton[3] || _includeSpecialButton[4] || _includeSpecialButton[5] || _includeSpecialButton[6] || _includeSpecialButton[7])
		{

			// USAGE_PAGE (Consumer Page)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x0C;

			// REPORT_COUNT
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
			tempHidReportDescriptor[hidReportDescriptorSize++] = (int)_includeSpecialButton[3] + (int)_includeSpecialButton[4] + (int)_includeSpecialButton[5] + (int)_includeSpecialButton[6] + (int)_includeSpecialButton[7];

			if (_includeSpecialButton[3])
			{
				// USAGE (Home)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x223;
			}

			if (_includeSpecialButton[4])
			{
				// USAGE (Back)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x224;
			}

			if (_includeSpecialButton[5])
			{
				// USAGE (Volume Increment)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0xE9;
			}

			if (_includeSpecialButton[6])
			{
				// USAGE (Volume Decrement)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0xEA;
			}

			if (_includeSpecialButton[7])
			{
				// USAGE (Mute)
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
				tempHidReportDescriptor[hidReportDescriptorSize++] = 0xE2;
			}

			// INPUT (Data,Var,Abs)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;
		}

		if (specialButtonPaddingBits > 0)
		{

			// REPORT_SIZE (1)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

			// REPORT_COUNT (# of padding bits)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
			tempHidReportDescriptor[hidReportDescriptorSize++] = specialButtonPaddingBits;

			// INPUT (Const,Var,Abs)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x03;

		} // Padding Bits Needed

	} // Special Buttons

	if (axisCount > 0)
	{
		// USAGE_PAGE (Generic Desktop)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

		// USAGE (Pointer)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

		// LOGICAL_MINIMUM (-32767)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x16;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x80;

		// LOGICAL_MAXIMUM (+32767)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x26;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0xFF;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x7F;

		// REPORT_SIZE (16)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x75;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x10;

		// REPORT_COUNT (axisCount)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x95;
		tempHidReportDescriptor[hidReportDescriptorSize++] = axisCount;

		// COLLECTION (Physical)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0xA1;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x00;

		if (_includeXAxis == true)
		{
			// USAGE (X)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x30;
		}

		if (_includeYAxis == true)
		{
			// USAGE (Y)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x31;
		}

		if (_includeZAxis == true)
		{
			// USAGE (Z)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x32;
		}

		if (_includeRzAxis == true)
		{
			// USAGE (Rz)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x35;
		}

		if (_includeRxAxis == true)
		{
			// USAGE (Rx)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x33;
		}

		if (_includeRyAxis == true)
		{
			// USAGE (Ry)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x34;
		}

		if (_includeSlider1 == true)
		{
			// USAGE (Slider)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x36;
		}

		if (_includeSlider2 == true)
		{
			// USAGE (Slider)
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
			tempHidReportDescriptor[hidReportDescriptorSize++] = 0x36;
		}

		// INPUT (Data,Var,Abs)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x81;
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0x02;

		// END_COLLECTION (Physical)
		tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;

