lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
	_slider2 = slider2;

	if (_autoReport)
	{
		sendReport();
	}
}

void BleGamepad::setRudder(int16_t rudder)
{
	if (rudder == -32768)
	{
		rudder = -32767;
	}

	_rudder = rudder;

	if (_autoReport)
	{
		sendReport();
	}
}

void BleGamepad::setThrottle(int16_t throttle)
{
	if (throttle == -32768)
	{
		throttle = -32767;
	}

	_throttle = throttle;

	if (_autoReport)
	{
		sendReport();
	}
}

void BleGamepad::setAccelerator(int16_t accelerator)
{
	if (accelerator == -32768)
	{
		accelerator = -32767;
	}

	_accelerator = accelerator;

	if (_autoReport)
	{
		sendReport();
	}
}

void BleGamepad::setBrake(int16_t brake)
{
	if (brake == -32768)
	{
		brake = -32767;
	}

	_brake = brake;

	if (_autoReport)
	{
		sendReport();
	}
}

void BleGamepad::setSteering(int16_t steering)
{
	if (steering == -32768)
	{
		steering = -32767;
	}

	_steering = steering;

	if (_autoReport)
	{
		sendReport();
	}
}

void BleGamepad::setAutoReport(bool autoReport)
{
	_autoReport = autoReport;
}

bool BleGamepad::isPressed(uint8_t b)
{
	uint8_t index = (b - 1) / 8;
	uint8_t bit = (b - 1) % 8;
	uint8_t bitmask = (1 << bit);

	if ((bitmask & _buttons[index]) > 0)
		return true;
	return false;
}

bool BleGamepad::isConnected(void)
{
	return this->connectionStatus->connected;
}

void BleGamepad::setBatteryLevel(uint8_t level)
{
	this->batteryLevel = level;
	if (hid != 0)
		this->hid->setBatteryLevel(this->batteryLevel);
}

void BleGamepad::taskServer(void *pvParameter)
{
	BleGamepad *BleGamepadInstance = (BleGamepad *)pvParameter; // static_cast<BleGamepad *>(pvParameter);
	NimBLEDevice::init(BleGamepadInstance->deviceName);
	NimBLEServer *pServer = NimBLEDevice::createServer();
	pServer->setCallbacks(BleGamepadInstance->connectionStatus);

	BleGamepadInstance->hid = new NimBLEHIDDevice(pServer);
	BleGamepadInstance->inputGamepad = BleGamepadInstance->hid->inputReport(_hidReportId); // <-- input REPORTID from report map
	BleGamepadInstance->connectionStatus->inputGamepad = BleGamepadInstance->inputGamepad;

	BleGamepadInstance->hid->manufacturer()->setValue(BleGamepadInstance->deviceManufacturer);

	BleGamepadInstance->hid->pnp(0x01, 0x02e5, 0xabbb, 0x0110);
	BleGamepadInstance->hid->hidInfo(0x00, 0x01);

	NimBLESecurity *pSecurity = new NimBLESecurity();

	pSecurity->setAuthenticationMode(ESP_LE_AUTH_BOND);

	uint8_t *customHidReportDescriptor = new uint8_t[hidReportDescriptorSize];
	memcpy(customHidReportDescriptor, tempHidReportDescriptor, hidReportDescriptorSize);

	BleGamepadInstance->hid->reportMap((uint8_t *)customHidReportDescriptor, hidReportDescriptorSize);
	BleGamepadInstance->hid->startServices();

	BleGamepadInstance->onStarted(pServer);

	NimBLEAdvertising *pAdvertising = pServer->getAdvertising();
	pAdvertising->setAppearance(HID_GAMEPAD);
	pAdvertising->addServiceUUID(BleGamepadInstance->hid->hidService()->getUUID());
	pAdvertising->start();
	BleGamepadInstance->hid->setBatteryLevel(BleGamepadInstance->batteryLevel);

	ESP_LOGD(LOG_TAG, "Advertising started!");
	vTaskDelay(portMAX_DELAY); // delay(portMAX_DELAY);
}
